## Lesson 1. Getting started with pandas

In [1]:
#!pip install -q pandas numpy 
import numpy as np 
import pandas as pd

In [2]:
# Series: Population by Country Code
country_population = pd.Series(
    data=[61, 46, 11, 65, 10],
    index=["IT", "ES", "GR", "FR", "PO"],
    name="Country Population"
)
country_population
data = {"Name": ["Avery Bradley", "John Holland", "Jonas Jerebko",
                 "Jordan Mickey", "Terry Rozier", "Jared Sullinger", "Evan Turner"],
        "Team": ["Boston Celtics"] * 7,
        "Number": [0.0, 30.0, 8.0, None, 12.0, 7.0, 11.0],
        "Position": ["PG", "SG", "PF", "PF", "PG", "C", "SG"],
        "Age": [25.0, 27.0, 29.0, 21.0, 22.0, None, 27.0]
}
df_0 = pd.DataFrame(data)

In [3]:
country_population

IT    61
ES    46
GR    11
FR    65
PO    10
Name: Country Population, dtype: int64

In [4]:
country_population.index

Index(['IT', 'ES', 'GR', 'FR', 'PO'], dtype='object')

In [5]:
country_population.values

array([61, 46, 11, 65, 10])

In [6]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [7]:
df_0.index

RangeIndex(start=0, stop=7, step=1)

In [8]:
df_0.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age'], dtype='object')

In [9]:
df_0.values

array([['Avery Bradley', 'Boston Celtics', 0.0, 'PG', 25.0],
       ['John Holland', 'Boston Celtics', 30.0, 'SG', 27.0],
       ['Jonas Jerebko', 'Boston Celtics', 8.0, 'PF', 29.0],
       ['Jordan Mickey', 'Boston Celtics', nan, 'PF', 21.0],
       ['Terry Rozier', 'Boston Celtics', 12.0, 'PG', 22.0],
       ['Jared Sullinger', 'Boston Celtics', 7.0, 'C', nan],
       ['Evan Turner', 'Boston Celtics', 11.0, 'SG', 27.0]], dtype=object)

In [10]:
df_0.shape

(7, 5)

In [11]:
country_population

IT    61
ES    46
GR    11
FR    65
PO    10
Name: Country Population, dtype: int64

In [12]:
country_population["IT"]

np.int64(61)

In [13]:
country_population[0]

C:\Users\Admin\AppData\Local\Temp\ipykernel_15164\3766274803.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  country_population[0]

np.int64(61)

In [ ]:
# Create a Series from a list
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

# Create a Series from a dictionary
s2 = pd.Series({'Hanoi': 1000, 'HCMC': 2000})

In [15]:
s1

a    10
b    20
c    30
dtype: int64

In [16]:
s2

Hanoi    1000
HCMC     2000
dtype: int64

In [17]:
s3 = pd.Series(np.array([1, 2, 3]), index=['x', 'y', 'z'] )
s3

x    1
y    2
z    3
dtype: int64

In [18]:
s1

a    10
b    20
c    30
dtype: int64

In [22]:
s1.reindex(['a', 'b', 'c', 'd'], fill_value=0)
s1

a    10
b    20
c    30
dtype: int64

In [24]:
data = {'Province': ['Hanoi', 'HCMC', 'Danang'],
        'Population (millions)': [8.05, 8.99, 1.13]}
df = pd.DataFrame(data)
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [26]:
df_drop_row = df.drop(1)
df_drop_row

  Province  Population (millions)
0    Hanoi                   8.05
2   Danang                   1.13

In [27]:
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [28]:
df["Province"]

0     Hanoi
1      HCMC
2    Danang
Name: Province, dtype: object

In [29]:
df.Province

0     Hanoi
1      HCMC
2    Danang
Name: Province, dtype: object

In [31]:
df['Population (millions)']

0    8.05
1    8.99
2    1.13
Name: Population (millions), dtype: float64

In [32]:
df[['Province', 'Population (millions)']]

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [36]:
# Reindexing a Series with fill_value
df_1 = df.set_index('Province')
df_1

          Population (millions)
Province
Hanoi                      8.05
HCMC                       8.99
Danang                     1.13

In [37]:
df_1.loc["Hanoi"]

Population (millions)    8.05
Name: Hanoi, dtype: float64

In [38]:
df_1.iloc[0]

Population (millions)    8.05
Name: Hanoi, dtype: float64

In [39]:
df.index = [1,2,3]
df

  Province  Population (millions)
1    Hanoi                   8.05
2     HCMC                   8.99
3   Danang                   1.13

In [42]:
type(df.loc[1])

pandas.core.series.Series

In [43]:
df.iloc[1][1]

C:\Users\Admin\AppData\Local\Temp\ipykernel_15164\398771770.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][1]

np.float64(8.99)

In [44]:
df

  Province  Population (millions)
1    Hanoi                   8.05
2     HCMC                   8.99
3   Danang                   1.13

In [46]:
df.loc[1:2]

  Province  Population (millions)
1    Hanoi                   8.05
2     HCMC                   8.99

In [47]:
df.iloc[0:1]

  Province  Population (millions)
1    Hanoi                   8.05

In [48]:
df.loc[1,'Province']

'Hanoi'

In [49]:
df.loc[[1,2],"Province"]

1    Hanoi
2     HCMC
Name: Province, dtype: object

In [50]:
df.iloc[1,1]

np.float64(8.99)

In [52]:
df

  Province  Population (millions)
1    Hanoi                   8.05
2     HCMC                   8.99
3   Danang                   1.13

In [54]:
df["Population (millions)"]>8

1     True
2     True
3    False
Name: Population (millions), dtype: bool

In [55]:
df[df["Population (millions)"]>8 ]

  Province  Population (millions)
1    Hanoi                   8.05
2     HCMC                   8.99

In [57]:
import matplotlib.pyplot as plt
import seaborn as sns
titanic = sns.load_dataset("titanic")
df2 = titanic.head(10)
df2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [59]:
df2[df2['survived'] == 1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [60]:
df2[(df2['survived'] == 1)&(df2['sex']=='female')]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [61]:
df2[(df2['survived'] == 0)&(df2['sex']=='female')]

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

In [62]:
df2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [63]:
df2[df2['adult_male']]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True

In [65]:
df2[~df2['adult_male']]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False